Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །བྱང་ཆུབ་མཆོག་གི་ཆོས་རྣམས་སྟོན་པ་མཛད།
en: He teaches that Dharma of supreme, perfect enlightenment. {82}

source: །སེམས་ལ་འཇུག་པ་དང་ནི་སྒྲ་ཤེས་པ།
en: “ ‘There is understanding of the mind, the knowledge of words,

source: །ངེས་པའི་ཚིག་ལ་འཇུག་ཅིང་དོན་རྟོགས་དང་། །གནོད་པ་ཐམས་ཅད་རྟག་ཏུ་རྣམ་སྤང་པར།
en: Being established in definitions, with certainty of meanings, And all that is meaningless is always avoided:

source: །རྒྱལ་བ་ཆོས་ཀྱི་བདག་པོ་དེ་ལྟར་སྟོན།
en: That is what the Jina, the Lord of the Dharma, teaches. {83}

source: །སྐྱེས་བུ་དམ་པ་རྟག་ཏུ་ཡང་དག་བསྟེན།
en: “ ‘Always associating with good persons

source: །སྐྱེས་བུ་ངན་པ་དག་ནི་རྣམ་པར་སྤང་།
en: And always avoiding bad persons,

source: །རྒྱལ་བ་ལ་ཡང་རྟག་ཏུ་དད་ཅིང་དགའ།
en: And always being attracted to and delighting in the Jina:

source: །ཆོས་མཆོག་རྒྱལ་བ་དེ་ལྟར་སྟོན་པ་མཛད།
en: That is the supreme Dharma that the Jina teaches. {84}

source: །བཏགས་པ་དང་ནི་བརྡ་དང་ཐ་སྙད་དང་། །འཁོར་བའི་སྡུག་བསྔལ་རྣམས་ནི་རྟག་པར་སྤང་།
en: “ ‘The description of designations and appellations, The continual avoidance of the suffering of saṃsāra,

source: །རྙེད་དང་མ་རྙེད་པ་ལ་ཞུམ་པ་མེད།
en: And indifference to whether there is gain or no gain:

source: །ཆོས་ཀྱི་དམ་པ་རྒྱལ་བས་དེ་ལྟར་བསྟན།
en: That is the supreme Dharma that the Jina teaches. {85}

source: །བཀུར་སྟི་རྙེད་ཀྱང་མཚར་དུ་མི་བཟུང་ཞིང་།
en: “ ‘There is no amazement if honors are gained,

source: །བཀུར་སྟི་མ་བྱས་ན་ཡང་བཏང་སྙོམས་བཞག །ཡང་དག་བསྔགས་པས་ནམ་ཡང་རློམ་སེམས་མེད།
en: There is equanimity when there are no honors, And there is never pride when there are praises:

source: །འཇིག་རྟེན་ཕན་པའི་བསྟན་པ་འདི་འདྲའོ།
en: This is nature of the teaching that benefits the world. {86}

source: །གཤེ་ཞིང་སྨོད་པ་ཐམས་ཅད་བཟོད་པར་བྱ།
en: “ ‘All abuse and disgrace is endured,

source: །ཁྱིམ་པ་ཀུན་དང་ལྷན་ཅིག་མི་བསྟེན་ཅིང་།
en: There is no association with any householder,

source: །རབ་ཏུ་བྱུང་བ་དང་ཡང་འགྲོགས་མི་བྱ།
en: And there is no mingling with homeless mendicants:

source: །སྤྱོད་ཡུལ་མ་ཡིན་ཐམས་ཅད་རྣམ་སྤངས་ནས། །སངས་རྒྱས་སྤྱོད་ཡུལ་ལ་ནི་རབ་ཏུ་གནས།
en: Rejecting all that is not that conduct,

source: །སྤྱོད་པ་ཕུན་སུམ་ཚོགས་ཤིང་དུལ་བའི་སེམས།
en: And having perfect conduct and a well-controlled mind:

source: །ཆོས་ཀྱི་ཚུལ་འདི་བདེ་བར་གཤེགས་པས་བཤད།
en: That is the way of the Dharma that the Sugata teaches. {88}

source: །བྱིས་པའི་ཆོས་རྣམས་རྟག་ཏུ་རྣམ་པར་སྤང་།
en: “ ‘Always rejecting the dharma of the foolish,

source: །རིགས་སུན་པ་ཡང་ཐམས་ཅད་སྤང་བར་བྱ།
en: Rejecting all that disgraces the family of the Buddha,

source: །སངས་རྒྱས་བསྟན་པ་རྟག་པར་ཡོངས་སུ་བསྲུང་།
en: Always protecting the teaching of the Buddha:

source: །ཆོས་ཀྱི་བདག་པོ་རྒྱལ་བ་དེ་སྐད་སྟོན།
en: That is what the Jina, the Lord of the Dharma, teaches. {89}

source: །སྨྲ་བ་ཉུང་ཞིང་རབ་ཏུ་འབྲེལ་ལ་སྙན།
en: “ ‘Speaking little, pleasantly, and articulately,

source: །གཞན་དག་ལ་ཡང་ཚིག་འཇམ་དགེ་བར་སྨྲ།
en: Speaking good and gentle words to others,

source: །ཕས་ཀྱི་རྒོལ་བ་ཆོས་དང་ལྡན་པས་འདུལ།
en: Subjugating adversaries through the Dharma:

source: །རྒྱལ་བའི་རྗེས་སུ་བསྟན་པ་འདི་འདྲའོ།
en: That is the nature of the Jina’s teaching. {90}

source: །དུས་སུ་འགྲོ་སྟེ་དུས་ལ་མ་བབ་མིན།
en: “ ‘Arriving at the right time, and not the wrong time,

source: །སོ་སོའི་སྐྱེ་བོ་ཀུན་ལ་ཡིད་མི་བརྟན།
en: Never depending on any ordinary being,

source: །སྡུག་བསྔལ་རེག་ཀྱང་ཡི་མུག་མེད་པར་བྱ།
en: Not being saddened on encountering suffering:

source: །དབུལ་པོ་མཐོང་ན་ནོར་དང་ལྡན་པར་བྱ།
en: “ ‘When seeing the poor, bringing them wealth;

source: །ཚུལ་ཁྲིམས་འཆལ་པ་མཐོང་ན་བརྩེ་བ་བསྐྱེད།
en: When seeing those with bad conduct, feeling compassion;

source: །ཕན་པའི་དངོས་ལ་རྟག་ཏུ་གདམས་པར་བྱ།
en: Always teaching those things that are beneficial:

source: །ཆོས་ཀྱིས་སེམས་ཅན་རྣམས་ལ་ཕན་གདགས་ཤིང་།
en: “ ‘Benefiting beings through the Dharma,

source: །འཇིག་རྟེན་ཟང་ཟིང་རྟག་ཏུ་གཏང་བར་བྱ།
en: Always giving away worldly material things,

source: །བསགས་པར་མི་བྱ་སྤུང་བར་མི་བྱ་སྟེ།
en: Never accumulating, never amassing:

source: །ཚུལ་ཁྲིམས་བསྔགས་ཤིང་ཚུལ་ཁྲིམས་འཆལ་པ་སྨད།
en: “ ‘Praising correct conduct and condemning bad conduct,

source: །གཡོ་སྒྱུ་མེད་ཅིང་ཚུལ་ཁྲིམས་ལྡན་ལ་སྟེན།
en: Being free of dishonesty and relying on those with correct conduct,

source: །ནོར་ལ་མི་གནས་བདོག་པ་ཐམས་ཅད་གཏོང་།
en: Giving away one’s possessions and not relying on wealth:

source: །ལྷག་པའི་བསམ་པས་བླ་མ་གཉེར་བ་དང་། །ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་ཐམས་ཅད་བྱ།
en: “ ‘Providing for the guru with a higher motivation, Doing all that he has told one to do,

source: །ཆོས་སྨྲ་བ་ཡང་མི་འཆད་བསྟེན་པར་བྱ།
en: Never ceasing from serving the dharmabhāṇaka:

source: །རི་མོར་བཅས་ཤིང་རྟག་ཏུ་ཡིད་དགར་བྱ།
en: “ ‘Always being respectful and delighted,

source: །ཞི་བའི་ལྟ་བས་ཁོར་མོར་གནས་པར་བྱ།
en: Remaining continually in a peaceful view,

source: །སྔོན་སྤྱོད་རྣམས་ལ་རྟག་པར་ཤིན་ཏུ་ངེས།
en: Always being sure of one’s past conduct:

source: །དགེ་བའི་སྤྱོད་པར་རྟག་ཏུ་སྔོན་དུ་འགྲོ།
en: “ ‘Always following those with correct conduct,

source: །འདུ་ཤེས་བཟློག་དང་དངོས་པོའི་མཚན་ཉིད་དང་། །མཚན་མ་སྤང་བ་ལ་ཡང་ཐབས་མཁས་པ།
en: With skillful methods shunning concepts, Repelling identification and the characteristics of things:

source: །མདོ་སྡེ་སྒྲུབ་པའི་ཚིག་ལ་མཁས་པ་དང་། །བདེན་པ་བསྟན་པའི་ཚིག་ལ་གདོན་མི་ཟ།
en: “ ‘Being skilled in the words produced within the sūtras, Having certainty in the words that teach the truth,

source: །རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མངོན་དུ་བྱེད།
en: The manifestation of the wisdom of liberation:

source: །མགོ་གཅིག་ཏུ་ནི་ཚིག་རྣམས་བརྗོད་པར་བྱ།
en: “ ‘Speaking words that are never contradictory,

source: །ཇི་ལྟ་བཞིན་དུ་མཐོང་ཞེས་རྟོགས་པར་མཁས།
en: Skillful in the certainty of what is taught,

source: །རྟག་ཏུ་ཚིག་ལ་ཐེ་ཚོམ་མེད་པར་བྱ།
en: And using words that will not be doubted:

source: །སྟོང་པ་ཉིད་ཀྱི་ཆོས་ཀྱང་རྟག་ཏུ་བསྟེན།
en: “ ‘Always relying on the Dharma of emptiness,

source: །འཇིགས་པ་མེད་ཅིང་ཚུལ་ཁྲིམས་སྟོབས་ལ་གནས།
en: Maintaining fearlessly the power of correct conduct,

source: །ཏིང་འཛིན་གནས་ཀྱིས་མཉམ་པར་འཇུག་པར་བྱ།
en: And applying equality through remaining in samādhi:

source: །ཤེས་ཀྱི་ཁེ་འདོད་ཕྱིར་ནི་ཡོང་མི་བསྟན།
en: “ ‘Not wishing to attain intellectual knowledge,

source: །སེམས་ཀྱང་གྱ་གྱུ་ཅན་དུ་མི་བྱ་སྟེ།
en: Keeping the mind free from hypocrisy,

source: །བལྟ་བར་བྱས་པ་ཐམས་ཅད་རྣམ་པར་སྤང་།
en: And rejecting the creation of any view:

source: །སྤོབས་པ་མཆོག་དང་གཟུངས་ཀྱང་དམ་པ་སྟེ།
en: “ ‘Supreme confidence in speech and sublime retention,

source: །ཡེ་ཤེས་སྣང་བ་ཕ་རོལ་མཐའ་མ་མེད།
en: The limitless radiance of wisdom,

source: །གསང་སྔགས་བྱིན་བརླབས་རིགས་པར་སྤོབས་པ་ནི།
en: And correct eloquence with the power of mantra:

source: །ལམ་འདི་སྒོམ་པ་དག་ནི་ཚུལ་གྱི་སྒོ།
en: “ ‘Meditation on the path through this doorway of correct conduct,

source: །བསྟན་པ་འདི་ལ་སྤྱད་ནས་ནན་ཏན་དང་། །ཚུལ་དང་གདམས་པ་རྗེས་སུ་བསྟན་པ་བཟང་།
en: Excellent practice, instruction, and conduct, And teaching that follows practicing the teaching:

source: །རྗེས་སུ་འཐུན་པའི་བཟོད་པ་སངས་རྒྱས་བསྔགས།
en: “ ‘The appropriate patience that is praised by the buddhas,

source: །བཟོད་ལ་གནས་པས་ཉེས་པ་རྣམ་པར་སྤང་།
en: The maintenance of patience that avoids bad actions,

source: །ཡེ་ཤེས་ལ་ཡང་གནས་ནས་མི་ཤེས་སྤང་།
en: And eliminating ignorance by being established in knowledge:

source: །ཡེ་ཤེས་རྟེན་ཡིན་དེ་བཞིན་རྣལ་འབྱོར་ས།
en: “ ‘The level of yoga that is based upon wisdom,

source: །བྱང་ཆུབ་ཞུགས་པའི་རྣལ་འབྱོར་དབང་ཕྱུག་སྟེ།
en: The mastery of yoga through entering enlightenment,

source: །སྐྱེས་བུ་དམ་པ་རྟག་པར་བསྟེན་པ་ནི།
en: The continual reliance on good beings:

source: །མི་རིགས་བརྩོན་པ་ཁོར་མོར་རྣམ་པར་སྤང་།
en: “ ‘It is the constant avoidance of unrestrained practitioners,

source: །སངས་རྒྱས་ས་ནི་དེ་བཞིན་གཤེགས་པས་བཤད།
en: It is the level of buddhahood taught by tathāgatas,

source: །མཁས་པ་ཀུན་གྱིས་རྗེས་སུ་ཡི་རང་བ།
en: And it is rejoiced in by all who are wise:

source: །བྱིས་པ་མི་ཤེས་པས་ནི་སྤངས་པ་སྟེ།
en: “ ‘It is rejected by the foolish and ignorant.

source: །འདི་ནི་ཉན་ཐོས་མང་པོའི་ས་མ་ཡིན།
en: It is not the level of the numerous śrāvakas,

source: །བྱང་ཆུབ་སེམས་དཔའ་དག་གིས་རྟག་ཏུ་བཟུང་།
en: And it is always obtained by the bodhisattvas:

source: །འདི་ནི་དེ་བཞིན་གཤེགས་པའི་རྗེས་སུ་འབྲང་།
en: “ ‘It is realized by the tathāgatas.

source: །ལྷ་རྣམས་ཀྱིས་ཀྱང་མཆོད་ཅིང་རི་མོར་བྱས།
en: It is offered to and honored by the devas.

source: །ཚངས་པ་བྱེ་བ་ཕྲག་སྟོང་ཡི་རང་བ།
en: It is rejoiced in by a hundred billion Brahmās.

source: །ཏིང་འཛིན་དེ་ནི་རྒྱལ་བ་སྟོན་མཛད་དམ། །ནམ་མཁའ་ལྡིང་དང་གནོད་སྦྱིན་མི་འམ་ཅི།
en: Is the Jina teaching this samādhi? {107}

source: །ཀླུ་ཡང་སྟོང་གིས་རྟག་ཏུ་ཕྱག་བྱས་པ།
en: “ ‘Thousands of nāgas always pay homage to it, And so do garuḍas, yakṣas, and kinnaras.

source: །བྱང་ཆུབ་དམ་པ་རྒྱལ་བས་གསུངས་པ་ཡི།
en: It is the supreme enlightenment taught by the Jina.

source: །ཤིན་ཏུ་མཁས་པས་རྟག་ཏུ་ཡོངས་ཐོབ་སྟེ།
en: “ ‘It is always obtained by those who are wise.

source: །ནོར་མཆོག་དམ་པ་ཡང་ནི་ལེགས་པར་རྙེད།
en: It is the perfect attainment of the best, supreme wealth.

source: །ཟང་ཟིང་མེད་པའི་ཡེ་ཤེས་གསོ་བ་མཆོག །ཏིང་འཛིན་དེ་ནི་རྒྱལ་བས་བཤད་མཛད་དམ།
en: It is the supreme nonmaterial medicine of wisdom. Is the Jina teaching this samādhi? {109}

source: །ཡེ་ཤེས་མཛོད་ཡིན་སྤོབས་པ་མི་ཟད་པ།
en: “ ‘It is wisdom’s treasure of unceasing eloquence.

source: །འདི་ནི་མདོ་སྡེ་བྱེ་བར་འཇུག་པ་སྟེ།
en: Ten million sūtras are contained within it.

source: །ཁམས་གསུམ་ཡོངས་ཤེས་ཡང་དག་ཤེས་པ་ཡི།
en: It is accurate knowledge, the complete knowledge of the three realms.

source: །ཏིང་འཛིན་དེ་ནི་རྒྱལ་བས་བཤད་མཛད་དམ། །གང་ལ་ཏིང་འཛིན་ཞི་བ་འདི་བཤད་པ།
en: Is the Jina teaching this samādhi? {110}

source: །འདི་ནི་ཕ་རོལ་འགྲོ་བའི་གཟིངས་སུ་བསྟན།
en: “ ‘It is a boat that crosses to the other shore,

source: །འདི་ནི་ཆུ་བོ་རྒལ་བའི་གྲུ་ཡིན་ཏེ།
en: It is a ship that crosses a great river,

source: །འདི་ནི་སྙན་གྲགས་བསྔགས་ཕྲེང་འཕེལ་བར་བྱེད།
en: And it increases fame and garlands of praises

source: །གང་གིས་ཏིང་འཛིན་ཞི་བ་འདི་བཤད་པ།
en: For those to whom this samādhi of peace is taught. {111} “ ‘Those who teach this samādhi of peace

source: །དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་བསྟོད་པ་ཡིན།
en: Are praised by all the tathāgatas,

source: །སྐྱེས་བུ་ཁྱུ་མཆོག་ལ་ཡང་བསྔགས་པ་སྟེ།
en: Extolled by the chiefs among humans,

source: །བྱང་ཆུབ་སེམས་དཔའི་མི་ཟད་ཡོན་ཏན་ཚུལ། །གང་དག་ལ་ནི་ཏིང་འཛིན་འདི་བཤད་པ།
en: And unceasingly commended by bodhisattvas. {112}

source: །འདི་ནི་ཞེ་སྡང་ཞི་བར་བྱམས་པ་བསྟན།
en: “ ‘It is the teaching of love to end bad actions.

source: །འདི་ནི་སྙིང་རྗེ་ཅན་གྱི་བཏང་སྙོམས་ས།
en: It is the level of compassion’s equanimity.

source: །འདི་ནི་གྲགས་པ་ཆེན་པོའི་དབུགས་འབྱིན་པ།
en: It is the comfort of the greatly famed ones For the ones to whom this samādhi is taught. {113}

source: །སེང་གེའི་སྒྲ་སྒྲོགས་རྣམས་ཀྱི་ནན་ཏན་ཏེ།
en: “ ‘It is the practice of the teaching of the lion’s roar.

source: །འདི་ལས་སངས་རྒྱས་ཡེ་ཤེས་མཆོག་ཀྱང་འབྱུང་།
en: It originates from the supreme wisdom of buddhahood.

source: །ཆོས་རྣམས་ཀུན་གྱི་རང་བཞིན་ཕྱག་རྒྱ་སྟེ།
en: It is the seal of the nature of all phenomena.

source: །ཏིང་འཛིན་འདི་ནི་འདྲེན་པ་དག་གིས་བཤད། །ཏིང་འཛིན་ཞི་བ་རྒྱལ་བས་བཤད་པ་འདི།
en: This is the samādhi taught by the guides. {114}

source: །ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཐོབ་པར་བྱེད།
en: “ ‘It brings the attainment of omniscient wisdom,

source: །འདི་ནི་བྱང་ཆུབ་རབ་ཞུགས་སྤྱོད་པ་སྟེ།
en: It is the conduct of those established in enlightenment,

source: །བདུད་ཀྱི་སྡེ་རྣམས་ཤིན་ཏུ་སྐྲག་པར་བྱེད།
en: And it also terrifies the army of the māras.

source: །རྒྱལ་བས་ཏིང་འཛིན་ཞི་བ་འདི་བཤད་པ།
en: This is the samādhi of peace taught by the Jina. {115}

source: །སྐྱོབ་པ་ཆོས་ལ་གནས་པའི་རིག་སྔགས་འདི།
en: “ ‘This knowledge is the protection that is based in the Dharma.

source: །དགྲ་ཡི་ནང་དུ་སྲུང་བ་དམ་པ་སྟེ།
en: It is the supreme protection in the midst of enemies.

source: །ཕས་ཀྱི་རྒོལ་བ་ཆོས་ཀྱིས་ཚར་གཅོད་པ།
en: It is the subjugation of adversaries through the Dharma:

source: །ཏིང་འཛིན་ཞི་བ་འདི་ལ་བསྟེན་བྱས་ན།
en: This is the samādhi of peace taught by the Jina. {116}

source: །འདི་ནི་སྤོབས་པའི་སར་ཡང་རབ་ཏུ་བསྟན།
en: “ ‘This is the teaching of the level of eloquence.

source: །སྟོབས་དང་རྣམ་ཐར་དེ་བཞིན་དབང་པོ་དང་། །སངས་རྒྱས་ཆོས་རྣམས་བཅྭ་བརྒྱད་བྱེ་བྲག་འཕགས།
en: It is the strengths, the liberations, and likewise the powers, And it is the eighteen unique qualities of a buddha: That is the practice of this samādhi, this peace. {117}

source: །སྟོབས་བཅུ་རྣམས་ཀྱང་ཡོངས་སུ་ཚོལ་བ་སྟེ།
en: “ ‘It is seeking the ten strengths,

source: །སངས་རྒྱས་ཡེ་ཤེས་ཀྱི་ཡང་སྔ་ལྟས་སོ།
en: It is the omen of the coming of buddha wisdom,

source: །སྐྱེས་མཆོག་འཇིག་རྟེན་ཕན་ཞིང་ཐུགས་བརྩེ་བས། །སངས་རྒྱས་ཆོས་རྣམས་རབ་ཏུ་བསྟན་པའང་ཡིན།
en: It is the buddhadharma taught by the supreme being, And it is the teaching that compassionately benefits the world. {118}

source: །སངས་རྒྱས་དག་གི་སྲས་ཀྱིས་འདི་བཟུང་སྟེ།
en: “ ‘It is possessed by the sons of the buddhas.

source: །འདི་ནི་རྣམ་ཐར་འདོད་པའི་ལམ་དུ་བསྟན།
en: It is the path taught for those who seek enlightenment.

source: །ཏིང་འཛིན་ཞི་བ་མཐོང་དཀའ་འདི་ཐོས་ནས། །དེ་ལ་བདེ་གཤེགས་སྲས་པོ་དགའ་བར་འགྱུར།
en: It is rejoiced in by the offspring of the sugatas When they hear this samādhi of peace that is difficult to see. {119}

source: །སངས་རྒྱས་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པ་དང་། །བྱང་ཆུབ་སེམས་དཔའ་མཁས་པ་ཚོལ་བ་འདི།
en: “ ‘It is the complete wisdom of buddhahood. It is what the wise bodhisattva seeks.

source: །རྣམ་དག་སེམས་གཙང་ཉོན་མོངས་མེད་པ་ཡིས།
en: One with a pure mind, clear and unblemished,

source: །ཏིང་འཛིན་ཞི་བ་འདི་ལ་བསྟེན་པར་གྱིས།
en: Practices the peace of this samādhi. {120}

source: །རྒྱལ་བ་བཞིན་དུ་དེ་ཡི་ལུས་དག་སྟེ།
en: “ ‘One who has a pure body like that of the jinas,

source: །རྣམ་པར་ཐར་དང་ཡེ་ཤེས་རྣམ་གྲོལ་མཐོང་།
en: Who has the knowledge of liberation, the vision of liberation,

source: །འདོད་ཆགས་འཆིང་བས་རྟག་ཏུ་ཉོན་མི་མོངས།
en: And who is never afflicted by the bondage of desire,

source: །ཏིང་འཛིན་བཟང་པོ་འདི་ལ་བསྟེན་པར་གྱིས།
en: Practices this excellent samādhi. {121}

source: །ཞེ་སྡང་ས་མིན་གཏི་མུག་བྲལ་བ་སྟེ།
en: “ ‘One who is not on the level of anger and is free of ignorance,

source: །བདེ་བ་འདོད་པའི་ཡེ་ཤེས་འབྱུང་བ་ཡིན།
en: In whom wisdom has arisen and who seeks liberation,

source: །རིག་པ་སྐྱེ་ཞིང་མ་རིག་འཇིག་པ་སྟེ།
en: In whom knowledge has developed and ignorance is destroyed,

source: །ཏིང་འཛིན་ཞི་བ་འདི་ལ་བསྟེན་པར་གྱིས། །རྣམ་གྲོལ་སྙིང་པོར་བྱེད་པ་ངོམས་པར་བཤད། །བསམ་གཏན་པ་ལ་ཏིང་འཛིན་ཞི་འདི་བསྟན།
en: Practices the peace of this samādhi. {122} “ ‘This samādhi of peace is taught to the meditator For whom liberation is central, and is fulfilled by this teaching.

source: །སངས་རྒྱས་མ་སྨད་པ་ཡི་སྤྱན་ཡིན་ཏེ།
en: The one with the sight of the faultless buddhas

source: །འདི་ནི་ཞིང་མང་སྟོན་པའི་མངོན་པར་ཤེས།
en: “ ‘The clairvoyance that reveals many realms,

source: །སངས་རྒྱས་མཐའ་ཡས་སྟོན་པའི་རྫུ་འཕྲུལ་ཏེ། །ཏིང་འཛིན་འདི་ཉིད་སྒོམ་པར་བྱེད་པ་ལ།
en: The miraculous powers that reveal infinite buddhas,

source: །གཟུངས་དེ་རྣམས་ཀྱང་རྙེད་པར་དཀའ་མི་འགྱུར།
en: And dhāraṇī is also not difficult to attain For the one who practices this samādhi. {124}

source: །བྱང་ཆུབ་ཕྱིར་ནི་དབང་པོ་ཞི་བའི་གནས།
en: “ ‘The senses are pacified in this state of enlightenment.

source: །འདི་ནི་བྱིན་རླབས་མཐའ་ཡས་སྟོན་པ་སྟེ། །ཏིང་འཛིན་འདི་ནི་བསྙེན་པར་བྱེད་པ་ཡི།
en: There is the revelation of infinite blessings,

source: །ཡེ་ཤེས་ཕྲ་ཞིང་ཡངས་པ་རྣམ་པར་དག །གང་གིས་ཏིང་འཛིན་ཞི་བ་འདི་མ་ཐོས།
en: And subtle, vast, and pure wisdom For the one who practices this samādhi. {125} “ ‘For the one who has not heard this samādhi of peace,

source: །མི་རིགས་བརྩོན་པས་འདི་ནི་རྟོགས་མི་འགྱུར།
en: Practice without self-restraint will bring no realization,

source: །ཡི་གེ་ཐམས་ཅད་རྣམ་པར་བཟློག་པ་སྟེ།
en: And as all the words will have been subverted,

source: །དབྱངས་ཀྱིས་རྣམ་པར་གོ་བར་ནུས་མ་ཡིན།
en: No understanding will be possible from speech. {126}

source: །བྱང་ཆུབ་སེམས་དཔའ་རིག་པས་འདི་ཤེས་ཏེ།
en: “ ‘This is known by wise bodhisattvas

source: །ཆོས་ཀྱི་བདག་པོས་ཇི་ལྟར་གང་བཤད་པ།
en: Just as taught by the Lord of Dharma. There is faultless realization of peace

source: །ཏིང་འཛིན་འདི་ལ་སྟེན་པར་བྱེད་པ་ཡི།
en: For the one who practices this samādhi. {127} “ ‘For the one who practices this samādhi

source: །ཞི་བ་དག་དང་སྨད་པ་མེད་པས་རྟོགས། །བརྩོན་འགྲུས་བརྩམས་པས་རབ་ཏུ་འདི་བཟུང་སྟེ།
en: With diligent application, having possession of it,

source: །བསྙེན་བཀུར་བྱས་ཤིང་རྟག་ཏུ་ལེགས་པར་བཅངས། །ཏིང་འཛིན་འདི་ལ་བསྙེན་པར་བྱེད་པ་ནི།
en: Constantly serving it, and perfectly keeping it,

source: །སྡུག་བསྔལ་ཟད་ཅིང་སྐྱེ་བ་འགོག་པ་ཤེས།
en: There will be cessation of suffering and the end of rebirth. {128}

source: །ཆོས་རྣམས་ཀུན་གྱི་སྐྱེ་བ་མེད་པ་བསྟན།
en: “ ‘It has been taught that all phenomena are birthless,

source: །དེ་ལྟར་སྲེད་པའི་འགྲོ་བ་ཐམས་ཅད་ན།
en: As are all the existences of beings.

source: །སངས་རྒྱས་གྲགས་ཆེན་དག་གི་ཡེ་ཤེས་མཆོག །ཏིང་འཛིན་དེ་ནི་རྒྱལ་བས་བཤད་མཛད་དམ།
en: Is the Jina teaching this samādhi Of the greatly famous, supremely wise buddhas?’ {129} “A full eighty-eight trillion beings

source: །གཞོན་ནུ་དེ་ཡིས་ཚིགས་བཅད་འདི་ཐོས་ནས། །ཁྲག་ཁྲིག་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བརྒྱད་རྣམས།
en: Heard these verses recited by the prince,

source: །དབྱངས་ཀྱི་རྗེས་འགྲོ་བཟོད་པ་དེར་ཐོབ་སྟེ།
en: Attained the patience that corresponded to those words,

source: །སངས་རྒྱས་ཡེ་ཤེས་ལས་ནི་མི་ལྡོག་གནས།
en: And were established in irreversible progress toward buddha wisdom. {130}

source: །བརྟན་པའི་སྟོབས་ཀྱིས་གཞོན་ནུ་དེ་ལ་སྨྲས།
en: “Dṛḍhabala said to the prince,

source: །ད་དུང་འཇིག་རྟེན་མགོན་པོ་དེ་བཞུགས་སོ།
en: ‘The Lord of the World is still present.

source: །ཁྱེའུ་ཁྱོད་ལ་ནི་དོན་འདི་དྲི་བར་བྱ།
en: I have a question for you, my son:

source: །ཏིང་འཛིན་འདི་ནི་ཁྱོད་ཀྱིས་སུ་ལས་ཐོས།
en: Where did you hear of this samādhi?’ {131}

source: །གཞོན་ནུས་སྨྲས་པ་རྒྱལ་པོ་གསན་དུ་གསོལ།
en: “The prince said to the king, ‘Listen!

source: །བདག་གིས་བསྐལ་པ་གཅིག་ལ་སངས་རྒྱས་ནི། །བྱེ་བ་ཁྲག་ཁྲིག་མཐོང་སྟེ་རི་མོར་བགྱིས།
en: During one eon I have seen A quintillion buddhas, honored them all,

source: །ཏིང་འཛིན་ཞི་བ་འདི་ཡང་བདག་གིས་དྲིས།
en: And asked them for this samādhi of peace. {132}

source: །གཞན་ཡང་བསྐལ་པ་དགུ་བཅུ་རྩ་དགུ་དང་། །བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་སྟོང་དུ།
en: “ ‘And for another ninety-four eons, And for a thousand quintillion eons,

source: །དེ་དང་དེར་བདག་སྐྱེ་བ་དྲན་པར་གྱུར།
en: I remember all my births wherever they were,

source: །ནམ་ཡང་མངལ་དུ་སྐྱེས་པར་མ་གྱུར་ཏོ།
en: And I was never born from a womb. {133}

source: །དེ་ནས་བདག་གིས་ཏིང་འཛིན་འདི་བསྒོམས་ཏེ།
en: “ ‘Then I meditated upon this samādhi.

source: །རྒྱལ་བ་དེ་དག་འཆད་པ་དག་པར་ཐོས།
en: I listened correctly to the teaching of those jinas.

source: །ཐོས་ནས་བཤད་པ་ལ་ཡང་མོས་བསྐྱེད་དེ།
en: Having heard it I had longing for what had been described.

source: །ནེམ་ནུར་མེད་པས་བྱང་ཆུབ་རེག་པར་བགྱི།
en: Free from uncertainty I embraced enlightenment. {134}

source: །དགེ་སློང་སུ་དག་བདག་ལ་ཀུན་འདྲི་ཞིང་།
en: “ ‘I questioned whatever bhikṣus

source: །ཏིང་འཛིན་འདི་ལ་ཡོངས་སུ་ཆུད་བགྱིད་པ།
en: Had understood this samādhi.

source: །དེ་ལ་བདག་ནི་གུས་པར་རི་མོར་བགྱིད།
en: I venerated them respectfully

source: །འཇིག་རྟེན་དོན་མཛད་དག་ལ་བགྱི་བ་བཞིན།
en: As if they were benefactors of the world. {135}

source: །སུ་ལས་བདག་གིས་ཚིགས་བཅད་གཅིག་ཙམ་ཡང་།
en: “ ‘When I received even one verse from them

source: །ལུང་མནོས་རྗེས་འཐུན་སྤྱད་པ་སྤྱོད་པའི་ཚེ།
en: I practiced that teaching properly

source: །དེ་དག་ལ་ཡང་བདག་ནི་སྟོན་པ་སྙམ།
en: And considered them to be teachers,

source: །སངས་རྒྱས་བཞིན་དུ་གུས་པས་རི་མོ་བགྱིད། །ཏིང་འཛིན་ཡོངས་སུ་ཆུབ་པར་བགྱིད་པ་འདི།
en: Venerating them with the respect shown to buddhas. {136}

source: །སུ་དག་ལ་ལ་བདག་ལ་འདྲི་བ་ཡང་།
en: “ ‘Whenever someone questioned me

source: །འཇིག་རྟེན་འདྲེན་པ་རྒྱལ་བར་མི་འགྱུར་བར། །རྨི་ལམ་ན་ཡང་བདག་ལ་ཐེ་ཚོམ་མེད།
en: About my understanding of this samādhi, Even in dreams I had no doubts That I would become a jina, a guide of the world. {137} “ ‘I respectfully attended

source: །དགེ་སློང་རྒན་རབས་བར་མ་གཞོན་ནུ་ལ།
en: To senior, middle, and junior bhikṣus.

source: །བདག་ནི་རི་མོ་གུས་དང་ལྡན་པར་བགྱིད།
en: With that respect my renown increased,

source: །རི་མོར་ལྡན་པས་བདག་གི་སྙན་པ་དང་། །དེ་བཞིན་བསོད་ནམས་གྲགས་པ་ཡོན་ཏན་འཕེལ།
en: As did my merit, fame, and qualities. {138}

source: །འཐབ་ཅིང་རྩོད་པ་དག་ལ་བརྩོན་མི་བགྱིད།
en: “ ‘I had no desire for conflict or quarrels.

source: །དེ་ཚེ་བདག་ནི་བརྩོན་པ་ཆུང་བར་འགྱུར།
en: At that time, I had few desires.

source: །སྡིག་པ་བགྱིས་པས་འགྲོ་བ་གཞན་དུ་འགྱུར།
en: Those who do bad actions are reborn in certain existences.

source: །དགེ་བ་བགྱིས་པས་འགྲོ་བ་གཞན་དུ་འགྱུར། །མི་རིགས་བརྩོན་པར་སྦྱོར་ཞིང་མ་བསྡམས་པ།
en: Those who do good actions are reborn in other existences. {139}

source: །དེ་དག་གི་ནི་མི་སྙན་ཚིག་ཐོས་ནས།
en: “ ‘One hears unpleasant words from those

source: །དེ་ཚེ་བདག་གིར་བགྱི་བ་ལས་སུ་འཛིན།
en: Who, without restraint, act inappropriately. At that time I became the lord of my own actions.

source: །ལས་རྣམས་བགྱིས་པ་རྣམ་པར་ཆུད་མི་ཟ།
en: The karma that is created is never lost. {140}

source: །དེ་ལ་ཁྲོ་བའི་དབང་དུ་མི་འགྱུར་ཏེ།
en: “ ‘I did not at that time become absorbed in anger.

source: །སངས་རྒྱས་བསྔགས་པའི་བཟོད་པའི་སྟོབས་འཛིན་ཏེ།
en: I maintained the power of patience, which is praised by the buddhas.

source: །འདྲེན་པ་དག་གིས་རྟག་ཏུ་བཟོད་པ་བསྔགས།
en: The guides have always praised patience;

source: །བཟོད་པ་བསྒོམས་ན་བྱང་ཆུབ་རྙེད་མི་དཀའ།
en: Attaining enlightenment is not difficult for those who practice patience. {141}

source: །བདག་ཀྱང་རྟག་ཏུ་ཚུལ་ཁྲིམས་ལྡན་པར་འགྱུར།
en: “ ‘I continually had correct conduct

source: །ཚུལ་ཁྲིམས་ལ་ཡང་གཞན་དག་རབ་ཏུ་འགོད།
en: And established others in correct conduct.

source: །ཚུལ་ཁྲིམས་བསྔགས་པ་རྟག་ཏུ་བདག་བརྗོད་དེ།
en: I always spoke the praises of correct conduct,

source: །དེ་ན་བདག་གི་ཚིག་ཀྱང་བཙུན་པར་གྱུར།
en: And what I spoke at that time was praiseworthy. {142}

source: །དགོན་པའི་བསྔགས་པ་དག་ཀྱང་རྟག་ཏུ་བརྗོད།
en: “ ‘I was always speaking the praises of solitude.

source: །ཚུལ་ཁྲིམས་ལ་ནི་རྟག་པར་རབ་གནས་ཏེ།
en: I always maintained correct conduct.

source: །རྟག་ཏུ་གསོ་སྦྱོང་དག་ཀྱང་འཛིན་དུ་སྩལ།
en: I established others in the poṣadha vows

source: །དེ་དག་བྱང་ཆུབ་ལ་ཡང་ཡང་དག་བཙུད།
en: And I introduced them to enlightenment. {143}

source: །དེ་དག་ཚངས་པའི་སྤྱོད་པ་ཡང་དག་བསྟབས།
en: “ ‘I established them in celibacy,

source: །ཆོས་དང་དོན་རྣམས་ལ་ཡང་རབ་ཏུ་གནས། །གང་ལ་མཐའ་དང་ཆགས་པ་འདི་མེད་པ།
en: I introduced them to the meaning of the Dharma,

source: །བྱང་ཆུབ་ལམ་ལ་དེ་དག་སད་པར་བགྱིས།
en: And I awoke them to the path to enlightenment, For which they had endless devotion. {144}

source: །བདག་དྲན་བསྐལ་པ་འདས་པའི་དུས་ཤིག་ན།
en: “ ‘I remember an eon in the past

source: །རྒྱལ་བ་སྒྲ་ཡི་ཡན་ལག་དབྱངས་བྱུང་སྟེ།
en: When there was the jina Svarāṅgaghoṣa.

source: །དེ་ཡི་སྤྱན་སྔར་བདག་གིས་དམ་བཅས་པ།
en: I took a vow in his presence

source: །བདག་ནི་རྟག་ཏུ་བཟོད་པའི་སྟོབས་ལྡན་བགྱི།
en: To have the power of patience at all times. {145}

source: །ཡི་དམ་བཅས་པ་དེ་ལ་གནས་ནས་ནི།
en: “ ‘I remained faithful to that vow

source: །ལོ་གྲངས་བྱེ་བ་བརྒྱད་ཅུ་ཕྲག་བཞིར་ཡང་།
en: For eight hundred and forty million years.

source: །བདག་ལ་བདུད་ཀྱིས་ཤིན་ཏུ་སྨད་ཅིང་སྤྱོས།
en: Although Māra reviled and abused me,

source: །འོན་ཀྱང་བདག་གི་སེམས་ནི་ཡོང་མ་འཁྲུགས།
en: My mind remained unshakable. {146}

source: །དེར་ནི་བདུད་ཀྱིས་བགམས་ཤིང་སད་ན་ཡང་།
en: “ ‘Māra put me to the test,

source: །བདག་གི་བྱམས་བཟོད་བརྟན་པ་འཚལ་ནས་ནི།
en: And discovered my love and patience to be enduring.

source: །སེམས་དང་བདག་གི་རྐང་ལ་ཕྱག་འཚལ་ཏེ།
en: And with faith he bowed down to my feet,

source: །ལྔ་བརྒྱ་བྱང་ཆུབ་མཆོག་ལ་རབ་ཏུ་ཞུགས།
en: And I established five hundred beings on the path to supreme enlightenment. {147}

source: །བདག་ནི་རྟག་ཏུ་སེར་སྣ་མེད་པར་གྱུར།
en: “ ‘At all times I was free of avarice

source: །གཏོང་བའི་བསྔགས་པ་དག་ཀྱང་ཁོར་མོར་འཆད།
en: And always praised generosity.

source: །ཕྱུག་ཅིང་ནོར་ལྡན་བདག་ཉིད་ཆེན་པོར་གྱུར།
en: I became wealthy, possessing many riches

source: །མུ་གེའི་ཚེ་ཡང་བདག་ཉིད་སྦྱིན་བདག་གྱུར།
en: And was a benefactor in times of famine. {148}

source: །དགེ་སློང་སུ་དག་ཏིང་འཛིན་འདི་འཛིན་ཅིང་།
en: “ ‘I pay homage to any monks Who possess this samādhi,
